import streamlit as st
import os
from PIL import Image

icon = Image.open(os.path.dirname(__file__) + '/../icon.png')

st.set_page_config(page_icon=icon)

st.title("❓ سوالات متداول")

st.markdown("""
اگر سؤال دیگری دارید، لطفاً در [توئیتر] (https://twitter.com/360macky) به من بگویید! خوشحال میشم بهشون جواب بدم
""")

st.write("## آینده چگونه می تواند باشد؟")

st.write("یک ویرایشگر ویدیویی را تصور کنید که به شما امکان می دهد فقط با نوشتن یک متن انیمیشن بسازید. رندر می تواند به این شکل باشد که فیلم ها ایجاد می شوند.")

st.write("## چگونه می توانم این برنامه را اصلاح کنم؟")

st.markdown("""
اگر می‌خواهید روی این مفهوم آزمایش کنید، می‌توانید [مخزن GitHub] (https://github.com/360macky/generative-manim) را جدا کنید، سپس یک حساب کاربری در [Streamlit] (https://streamlit.io/) ایجاد کنید. ، [داشبورد] (https://share.streamlit.io/) را باز کنید، روی دکمه *برنامه جدید* کلیک کنید و سپس روی دکمه *GitHub* کلیک کنید. سپس می توانید برنامه را در Streamlit مستقر کنید، سپس مخزن فورک شده را جستجو کنید، در مسیر فایل اصلی بنویسید `src/main.py` و در نهایت روی دکمه *Deploy!* کلیک کنید.

اکنون می توانید مخزن کلون شده را به روز کنید و تغییرات را در برنامه Streamlit خود مشاهده کنید. اگر فکر می کنید که تغییرات شما مفید هستند، می توانید یک درخواست کشش را به مخزن اصلی باز کنید. درخواست کشش به گرمی استقبال می شود.
""")

st.write("## رندر چیست؟")

st.write("رندر یک کتابخانه پایتون برای ایجاد انیمیشن های ریاضی است. منبع باز است. نسخه استفاده شده در این برنامه استریملیت، جامعه رندر است، که یک چنگال از کتابخانه اصلی رندر است.")

st.write("## GPT-3.5 چیست؟")

st.write("GPT-3.5 آخرین نسخه پایدار API مدل GPT OpenAI است. این یک مدل زبان پشت ChatGPT است.")

st.write("##GPT-4 چیست؟")

st.write("GPT-4 آخرین نسخه (اما ناپایدار و محدود) مدل GPT OpenAI است. GPT-4 در کارهایی که نیاز به استدلال پیشرفته، درک دستورات پیچیده و خلاقیت بیشتری دارند، برتری می یابد.")

st.write("## هدف این اپلیکیشن چیست؟")

st.write("هدف این است که نشان دهیم چگونه می توان از GPT-4 و GPT-3.5 برای صادر کردن کد رندر از یک درخواست استفاده کرد. این طراحی که ساده است، می تواند برای توانمندسازی ویرایشگرهای ویدیو یا به طور کلی برنامه ها استفاده شود.")

